Библиотека/src/Documents/ВозвратКниг/ВозвратКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратКниг</name>
  <basedOn>Task.ЗаказКниги</basedOn>
  <registerRecords>AccumulationRegister.КнигиВБиблиотеке</registerRecords>
  <attributes>
    <name>Абонент</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека/src/AccumulationRegisters/КнигиВБиблиотеке/КнигиВБиблиотеке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигиВБиблиотеке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.Операция</types>
    </type>
  </attributes>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРазмещения</name>
    <type>
      <types>CatalogRef.Абоненты</types>
      <types>CatalogRef.МестаРазмещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Библиотека/src/Enums/Операция/Операция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Операция</name>
  <enumValues>
    <name>ПоступлениеКниг</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаКнигиАбоненту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКнигиАбонентом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКниг</name>
  </enumValues>
</mdclass:Enum>

Библиотека/src/Documents/ВозвратКниг/ObjectModule.bsl
// Проверим что бы был указан абонент
Функция ПроверитьШапкуДокумента(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Абонент)Тогда
		Сообщить("Не указано лицо от которого поступила книга (абонент). Проведение отменено!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьШапкуДокумента(Отказ);
	ОбщегоНазначения.ПроверитьНаОдинаковыеПозиции(Книги, Отказ);
	
	// Вернем книги
	Для Каждого ТекСтрокаКниги Из Книги Цикл
		// Вернем в библиотеку с библиотеки
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;
		Движение.МестоРазмещения = Справочники.МестаРазмещения.Библиотека;
		Движение.Операция = Перечисления.Операция.ВозвратКнигиАбонентом;
		Движение.Количество = 1;
		// Спишем с абонента
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Книга = ТекСтрокаКниги.Книга;
		Движение.МестоРазмещения = Абонент;
		Движение.Операция = Перечисления.Операция.ВозвратКнигиАбонентом;
		Движение.Количество = 1;
	КонецЦикла;
	
	// Проверим что у этого абонента 0 книг
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КнигиВБиблиотекеОстатки.Книга,
		|	КнигиВБиблиотекеОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.КнигиВБиблиотеке.Остатки(
		|			&Период,
		|			Книга В
		|					(ВЫБРАТЬ
		|						Документ.Книга
		|					ИЗ
		|						Документ.ВозвратКниг.Книги КАК Документ
		|					ГДЕ
		|						Документ.Ссылка = &Ссылка)
		|				И МестоРазмещения = &Абонент) КАК КнигиВБиблиотекеОстатки
		|ГДЕ
		|	КнигиВБиблиотекеОстатки.КоличествоОстаток = 1";

	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Отказ = Запрос.Выполнить().Пустой();

КонецПроцедуры

// Обработка заполнения от задачи ЗаказКниги
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) тогда
		// Если заполняем документ из бизнес процесса заказа книг
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаСсылка.ЗаказКниги") Тогда
			Абонент = ДанныеЗаполнения.БизнесПроцесс.Автор.Абонент;
			Книги.Загрузить(ДанныеЗаполнения.БизнесПроцесс.КнигиКЗаказу.Выгрузить());
			Дата = ТекущаяДата();
			// Если заполняем документ из массива ссылко на книги
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
			Для каждого Книга из ДанныеЗаполнения цикл
				НоваяСтрока = Книги.Добавить();
				НоваяСтрока.Книга = Книга;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
